In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("city.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           36          6    rain
1   1/2/2017  new york           32          7   sunny
2   1/3/2017  new york           28         12    snow
3   1/4/2017  new york           33          7   sunny
4   1/1/2017    mumbai           90          5   sunny
5   1/2/2017    mumbai           85         12     fog
6   1/3/2017    mumbai           87         15     fog
7   1/4/2017    mumbai           92          5    rain
8   1/1/2017     pairs           45         20   sunny
9   1/2/2017     pairs           50         13  cloudy
10  1/3/2017     pairs           54          8  cloudy
11  1/4/2017     pairs           42         10  cloudy

In [3]:
df.max()

day            1/4/2017
city              pairs
temperature          92
windspeed            20
event             sunny
dtype: object

In [4]:
df.min()

day            1/1/2017
city             mumbai
temperature          28
windspeed             5
event            cloudy
dtype: object

In [6]:
df[['temperature','windspeed']].sum()

temperature    674
windspeed      120
dtype: int64

In [7]:
df[['temperature','windspeed']].avg()

AttributeError: 'DataFrame' object has no attribute 'avg'

In [8]:
df[['temperature','windspeed']].mean()

temperature    56.166667
windspeed      10.000000
dtype: float64

In [9]:
df[['temperature','windspeed']].count()

temperature    12
windspeed      12
dtype: int64

In [11]:
df[['city','windspeed']][df['windspeed']==df['windspeed'].max()]

    city  windspeed
8  pairs         20

In [13]:
df[['city','temperature']][df['temperature']==df['temperature'].min()]

       city  temperature
2  new york           28

In [14]:
df[['city','temperature']][df['temperature']==df['temperature'].sum()]

Empty DataFrame
Columns: [city, temperature]
Index: []

In [33]:
gro=df.groupby('city')
gro

In [59]:
gro.groups

{'mumbai': [4, 5, 6, 7], 'new york': [0, 1, 2, 3], 'pairs': [8, 9, 10, 11]}

In [20]:
gro.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain

In [25]:
gro.get_group('new york').max()

day            1/4/2017
city           new york
temperature          36
windspeed            12
event             sunny
dtype: object

In [32]:
gro=df.groupby('city').max()
gro

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  sunny
new york  1/4/2017           36         12  sunny
pairs     1/4/2017           54         20  sunny

In [30]:
gro.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
pairs           47.75      12.75

In [35]:
gro.sum()

          temperature  windspeed
city
mumbai            354         37
new york          129         32
pairs             191         51

In [36]:
gro['temperature'].get_group('mumbai').max()

92

In [37]:
#What was the maximum temperature in each of these 3 cities?
gro['temperature'].max()

city
mumbai      92
new york    36
pairs       54
Name: temperature, dtype: int64

In [50]:
#display the date and maximum temperature in mumbai
gro[['day','temperature']].max().loc['new york']

day            1/4/2017
temperature          36
Name: new york, dtype: object

In [52]:
gro[['day','temperature','windspeed','city']].max().loc['new york']

day            1/4/2017
temperature          36
windspeed            12
city           new york
Name: new york, dtype: object

In [54]:
for city,data in gro:
    print('city=',city)
    print(data)

city= mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain
city= new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           36          6   rain
1  1/2/2017  new york           32          7  sunny
2  1/3/2017  new york           28         12   snow
3  1/4/2017  new york           33          7  sunny
city= pairs
         day   city  temperature  windspeed   event
8   1/1/2017  pairs           45         20   sunny
9   1/2/2017  pairs           50         13  cloudy
10  1/3/2017  pairs           54          8  cloudy
11  1/4/2017  pairs           42         10  cloudy

In [60]:
for city,data in gro:
    if city=='mumbai' or city=='paris':
        print(city)
        print(data)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain

In [62]:
for city, data in gro:
    print("\n")
    print("city:",city)
    print("data:",data)

city: mumbai
data:         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain


city: new york
data:         day      city  temperature  windspeed  event
0  1/1/2017  new york           36          6   rain
1  1/2/2017  new york           32          7  sunny
2  1/3/2017  new york           28         12   snow
3  1/4/2017  new york           33          7  sunny


city: pairs
data:          day   city  temperature  windspeed   event
8   1/1/2017  pairs           45         20   sunny
9   1/2/2017  pairs           50         13  cloudy
10  1/3/2017  pairs           54          8  cloudy
11  1/4/2017  pairs           42         10  cloudy

In [64]:
mumdf=gro.get_group('mumbai')
mumdf

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain

In [65]:
mumdf.to_csv('mumbai_data.csv')
mumdf

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain

In [67]:
df.describe()

       temperature  windspeed
count    12.000000  12.000000
mean     56.166667  10.000000
std      25.044808   4.572646
min      28.000000   5.000000
25%      35.250000   6.750000
50%      47.500000   9.000000
75%      85.500000  12.250000
max      92.000000  20.000000

In [69]:
gro.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
pairs            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
pairs          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [71]:
gro.size()

city
mumbai      4
new york    4
pairs       4
dtype: int64

In [72]:
gro.count()

          day  temperature  windspeed  event
city
mumbai      4            4          4      4
new york    4            4          4      4
pairs       4            4          4      4

In [73]:
gro['temperature'].max()

city
mumbai      92
new york    36
pairs       54
Name: temperature, dtype: int64

In [76]:
for x,y in gro:
    print(x)
    print(y)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
5  1/2/2017  mumbai           85         12    fog
6  1/3/2017  mumbai           87         15    fog
7  1/4/2017  mumbai           92          5   rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           36          6   rain
1  1/2/2017  new york           32          7  sunny
2  1/3/2017  new york           28         12   snow
3  1/4/2017  new york           33          7  sunny
pairs
         day   city  temperature  windspeed   event
8   1/1/2017  pairs           45         20   sunny
9   1/2/2017  pairs           50         13  cloudy
10  1/3/2017  pairs           54          8  cloudy
11  1/4/2017  pairs           42         10  cloudy

In [79]:
g_col = df.groupby(["city","event"])
g_col

In [81]:
g_col.groups

{('mumbai', 'fog'): [5, 6], ('mumbai', 'rain'): [7], ('mumbai', 'sunny'): [4], ('new york', 'rain'): [0], ('new york', 'snow'): [2], ('new york', 'sunny'): [1, 3], ('pairs', 'cloudy'): [9, 10, 11], ('pairs', 'sunny'): [8]}

In [84]:
g_col.get_group(('mumbai', 'fog'))

        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   fog
6  1/3/2017  mumbai           87         15   fog

In [85]:
for x,y in g_col:
    print(x)
    print(y)

('mumbai', 'fog')
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   fog
6  1/3/2017  mumbai           87         15   fog
('mumbai', 'rain')
        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  rain
('mumbai', 'sunny')
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  sunny
('new york', 'rain')
        day      city  temperature  windspeed event
0  1/1/2017  new york           36          6  rain
('new york', 'snow')
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  snow
('new york', 'sunny')
        day      city  temperature  windspeed  event
1  1/2/2017  new york           32          7  sunny
3  1/4/2017  new york           33          7  sunny
('pairs', 'cloudy')
         day   city  temperature  windspeed   event
9   1/2/2017  pairs           50         13  cloudy
10  1/3/2017  pairs           54          8  cloudy
11  1/4/2017  pairs           42         10  cloudy
('pairs', 'sunny')
        day   city  temperature  windspeed  event
8  1/1/2017  pairs           45         20  sunny

In [86]:
tempdf=pd.DataFrame(g_col)
tempdf

                   0                                                  1
0      (mumbai, fog)          day    city  temperature  windspeed ev...
1     (mumbai, rain)          day    city  temperature  windspeed ev...
2    (mumbai, sunny)          day    city  temperature  windspeed  e...
3   (new york, rain)          day      city  temperature  windspeed ...
4   (new york, snow)          day      city  temperature  windspeed ...
5  (new york, sunny)          day      city  temperature  windspeed ...
6    (pairs, cloudy)           day   city  temperature  windspeed   ...
7     (pairs, sunny)          day   city  temperature  windspeed  ev...

In [99]:
df1=pd.DataFrame({"citys":["bangalore","chicago","canada","san francisco"],"places":["cubbon","navy pier","neob lavender","golden gate park"]})
df1

           citys            places
0      bangalore            cubbon
1        chicago         navy pier
2         canada     neob lavender
3  san francisco  golden gate park

In [101]:
df2=pd.DataFrame({"citys":["bangalore","chicago","canada","paris"],"state":["karnataka","us","sa","france"]})
df2

       citys      state
0  bangalore  karnataka
1    chicago         us
2     canada         sa
3      paris     france

In [95]:
df3=pd.merge(df1,df2)
df3

       citys         places      state
0  bangalore         cubbon  karnataka
1    chicago      navy pier         us
2     canada  neob lavender         sa

In [96]:
df3=pd.merge(df1,df2,on="citys")
df3

       citys         places      state
0  bangalore         cubbon  karnataka
1    chicago      navy pier         us
2     canada  neob lavender         sa

In [102]:
df4=pd.merge(df1,df2,on='citys',how='outer')
df4

           citys            places      state
0      bangalore            cubbon  karnataka
1        chicago         navy pier         us
2         canada     neob lavender         sa
3  san francisco  golden gate park        NaN
4          paris               NaN     france

In [103]:
df4=pd.merge(df1,df2,on='citys',how='inner')
df4

       citys         places      state
0  bangalore         cubbon  karnataka
1    chicago      navy pier         us
2     canada  neob lavender         sa

In [105]:
df5=pd.merge(df1,df2,on='citys',how='left')
df5

           citys            places      state
0      bangalore            cubbon  karnataka
1        chicago         navy pier         us
2         canada     neob lavender         sa
3  san francisco  golden gate park        NaN

In [110]:
df6=pd.merge(df1,df2,on='citys',how='right')
df6

       citys         places      state
0  bangalore         cubbon  karnataka
1    chicago      navy pier         us
2     canada  neob lavender         sa
3      paris            NaN     france

In [109]:
df7=pd.merge(df1,df2,on="citys",how="outer",indicator=True)
df7

           citys            places      state      _merge
0      bangalore            cubbon  karnataka        both
1        chicago         navy pier         us        both
2         canada     neob lavender         sa        both
3  san francisco  golden gate park        NaN   left_only
4          paris               NaN     france  right_only

In [111]:
df8=pd.merge(df1,df2,on="citys",how="inner",indicator=True)
df8

       citys         places      state _merge
0  bangalore         cubbon  karnataka   both
1    chicago      navy pier         us   both
2     canada  neob lavender         sa   both

In [113]:
df9=pd.merge(df1,df2,on="citys",how="left",indicator=True)
df9

           citys            places      state     _merge
0      bangalore            cubbon  karnataka       both
1        chicago         navy pier         us       both
2         canada     neob lavender         sa       both
3  san francisco  golden gate park        NaN  left_only

In [114]:
df10=pd.merge(df1,df2,on="citys",how="right",indicator=True)
df10

       citys         places      state      _merge
0  bangalore         cubbon  karnataka        both
1    chicago      navy pier         us        both
2     canada  neob lavender         sa        both
3      paris            NaN     france  right_only